[
    {
        "name": "Portfolio Website",
        "description": "A fully custom personal portfolio built with HTML, CSS, and vanilla JavaScript. Features smooth scroll animations, typing effect, responsive navbar, and dynamic project rendering from a JSON file.",
        "link" : "https://zahraqaisar.github.io/Portfolio/"
    },
    {
        "name": "Spotify Clone",
        "description": "Built a responsive Spotify-style music interface using React, Tailwind CSS, and JSON-based data for tracks and playlists. Implemented reusable UI components, playlist browsing, and modern styling to replicate core Spotify UI elements.",
        "link" : "https://spotify-clone-webify.vercel.app"
    },
    {
        "name": "Google Forms",
        "description": "Built a Google Forms clone using the MERN stack with full form creation and response storage. Implemented JWT authentication, secure REST APIs, and a responsive UI using Tailwind CSS.",
        "link" : "https://google-form-frontend-live.vercel.app"
    },
    {
        "name": "Forever E-commerce",
        "description": "Built a fully functional E-commerce platform using the MERN stack with user authentication, product browsing, cart management, and order placement integrated with MongoDB.Developed an admin dashboard to add/remove products, manage inventory, and view customer orders using secure REST APIs and a responsive frontend.",
        "link" : "https://forever-frontend-taupe-iota.vercel.app"
    },
    {
        "name": "Real-Estate",
        "description": "Built a responsive real estate website with property listings and search functionality.Created interactive UI components using React.js and styled with Tailwind CSS. Focused on clean design and mobile-friendly layout.",
        "link" : "https://agency-ai-webify.netlify.app"
    },
    {
        "name": "CourierBox",
        "description": "A full-stack courier booking and tracking system built with the MERN stack. Users can regsiter, log-in/log-out, book parcels and track delivery; admins manage and update parcel status through a secure dashboard.",
        "link" : "https://zahraqaisar.github.io/Portfolio/"
    },
    {
        "name": "TaskEase",
        "description": "Django-based service finder app to hire helpers (maids, drivers, guards) by category and location. Includes user profiles registering, log-in/out, and an admin dashboard for managing listings.",
        "link" : "https://zahraqaisar.github.io/Portfolio/"
    },
    {
        "name": "MovieApp",
        "description": "A Django-based entertainment platform where users can view movies, read about celebrities, subscribe, log in/out, and comment on blogs. Includes user authentication and blog interaction features.",
        "link" : "https://zahraqaisar.github.io/Portfolio/"
    }
]